Repository: Lyakhonov/OmegaT
Catalog: OmegaT-level2.tmx
Source language: ru_ru
Languages: en

source: 6.3. Определение списка подсистем, в которых будет отражаться регистр
en: 6.3. Defining the list of subsystems in which the register will be reflected

source: 6.4. Создание измерений регистра
en: 6.4. Creating register dimensions

source: 6. 5 . Регистр « ОстаткиМатериалов »
en: 6. 5 . Register " ОстаткиМатериалов "

source: 6. 6 . Создание движений документа « ПриходнаяНакладная » в регистре « ОстаткиМатериалов »
en: 6. 6 . Creation of document movements “ ПриходнаяНакладная ” in the register “ ОстаткиМатериалов ”

source: 6. 7 . Список регистра накопления « Остатки материалов »
en: 6. 7 . List of accumulation register " Remaining materials "

source: В пользовательском режиме
en: In user mode

source: В нижнем окне сформируется соответствие атрибутов регистра и документа . К онструктор движений установил соответствия подходящим образом: в качестве материала в регистр будет записан материал из табличной части документа, в качестве склада – склад, указанный в шапке документа, а в качестве количества – количество из табличной части документа.
en: In the lower window, a correspondence will be formed between the attributes of the register and the document . The movement constructor has set the correspondences in the appropriate way: the material from the document's tabular section will be recorded in the register as the material, the warehouse specified in the document's header as the warehouse, and the quantity from the document's tabular section as the quantity.

source: В открывшемся окне мы видим, что в панели функций разделов Бухгалтерия , Оказание услуг и Учет материалов в конце списка команд для открытия различных списков, перед подменю Создать , Отчеты (если они есть) появилась команда для открытия списка регистра Остатки материалов (рис. 6. 8 ).
en: In the window that opens, we see that in the function panel of the sections Accounting , Services and Accounting of materials at the end of the list of commands for opening various lists, before the submenu Create , Reports (if they exist) a command has appeared for opening the register list Material balances (pic. 6. 8 ).

source: В открывшемся окне редактирования объекта на закладке Основные зададим имя регистра – ОстаткиМатериалов .
en: In the opened object editing window, on the Main tab, we will set the register name – ОстаткиМатериалов .

source: В режиме разработки
en: In development mode

source: В результате этих действий регистр ОстаткиМатериалов должен иметь следующий вид (рис. 6. 5 ).
en: As a result of these actions, the register ОстаткиМатериалов should have the following appearance (pic. 6. 5 ).

source: Выделим закладку Данные и перейдем к созданию структуры регистра.
en: We will select the Data tab and proceed to creating the register structure.

source: Глоссарий
en: Glossary

source: Движения документа
en: Document movements

source: Движения документа – это записи в регистрах, которые создаются в процессе проведения документа и отражают изменения, производимые документом.
en: Document movements are records in registers that are created during the process of document posting and reflect the changes made by the document.

source: Движения документа – это записи в регистрах, которые создаются в процессе проведения документа и отражают изменения, производимые этим документом.
en: Document movements are records in registers that are created during the process of document posting and reflect the changes made by this document.

source: Для накопления такой информации мы создадим регистр Остатки м атериалов .
en: To accumulate such information, we will create a register Remaining m aterials .

source: Для этого выделим в дереве объектов ветвь Регистры накопления и нажмем кнопку Добавить в командной панели.
en: To do this, select the Accumulation registers branch in the object tree and click the Add button in the command panel.

source: Для этого выделим ветвь Измерения и нажмем кнопку Добавить в командной панели окна (рис. 6.4).
en: To do this, select the branch Dimensions and click the button Add in the command bar of the window (Pic. 6.4).

source: Если вы сейчас попытаетесь запустить систему в пользовательском режиме , то система выдаст сообщение об ошибке: « РегистрНакопления.ОстаткиМатериалов : Ни один из документов не является регистратором для регистра».
en: If you now try to start the system in user mode , the system will return an error message: " РегистрНакопления.ОстаткиМатериалов : None of the documents are registrars for the register."

source: Запустим систему в пользовательском режиме и протестируем внесенные нами изменения.
en: Let's run the system in user mode and test the changes we've made.

source: Количество , тип Число ;
en: Количество , type Число ;

source: Листинг 6.1. Процедура « ОбработкаПроведения ()»
en: Listing 6.1. Процедура " ОбработкаПроведения ()"

source: Материал , тип СправочникСсылка.Номенклатура ;
en: Материал , type СправочникСсылка.Номенклатура ;

source: На основе объекта Регистр Н акопления платформа создает в базе данных таблицы, в которых будут накапливаться данные, поставляемые различными объектами базы данных.
en: Based on the Регистр Н акопления object, the platform creates tables in the database in which data supplied by various database objects will be accumulated.

source: Нажмем Далее и перейдем на закладку Подсистемы .
en: Click Next and go to the Subsystems tab.

source: Нажмем ее и воспользуемся этим конструктором. Н ажмем кнопку Заполнить выражения .
en: We will click it and use this constructor. We will c lick the Fill expressions button.

source: Нажмем кнопку OK и посмотрим, какой текст сформировал конструктор в документ е ПриходнаяНакладная (листинг 6.1).
en: We will press the OK button and see what text the designer generated in the documen t ПриходнаяНакладная (listing 6.1).

source: Обратите внимание, что сразу после отметки выбранного регистра становится доступной кнопка Конструктор движений .
en: Please note that immediately after marking the selected register, the Movement Constructor button becomes available.

source: Объект Регистр накопления предназначен для описания структуры накопления данных.
en: The object Accumulation register is intended to describe the structure of data accumulation.

source: Откроем в режиме разработки систему и добавим новый объект Регистр накопления .
en: Let's open the system in development mode and add a new object Accumulation register .

source: Откроем окно редактирования объекта Документ.ПриходнаяНакладная .
en: Let's open the window for editing the object Документ.ПриходнаяНакладная .

source: Перейдем на закладку Движения , раскроем список Регистры накопления и отметим регистр накопления ОстаткиМатериалов (рис. 6.7).
en: We will go to the Movements tab, open the Registers Accumulation list and mark the accumulation register ОстаткиМатериалов (pic. 6.7).

source: По логике нашей конфигурации данный регистр должен быть доступен в разделах Учет материалов , Оказание услуг и Бухгалтерия .
en: According to the logic of our configuration, this register should be available in the sections Accounting of materials , Rendering services and Accounting .

source: Поэтому мы сформируем движения регистра накопления ОстаткиМатериалов для двух созданных нами документов ПриходнаяНакладная и ОказаниеУслуг .
en: Therefore, we will form the movements of the accumulation register ОстаткиМатериалов for two documents we created ПриходнаяНакладная and ОказаниеУслуг .

source: Поэтому отметим в списке подсистем эти подсистемы (рис. 6.3).
en: Therefore, we will mark these subsystems in the list of subsystems (pic. 6.3).

source: Представим , что нас интересует информация о том, сколько и каких материалов есть у нас на складах.
en: Let's imagine , that we are interested in information about how much and what kind of materials we have in our warehouses.

source: Регистр накопления – объект, предназначенный для описания структуры накопления данных.
en: Accumulation register is an object intended for describing the structure of data accumulation.

source: Рис.
en: pic.

source: Склад , тип СправочникСсылка.Склады ;
en: Склад , type СправочникСсылка.Склады ;

source: Создадим атрибуты регистра:
en: We will create register attributes :

source: Создание регистра накопления
en: Creating accumulation register

source: Также зададим и П редставление списка как Движения по регистру Остатки материалов .
en: We will also define the R epresentation of the list as Movements by the Material Remaining Register .

source: Эти данные будут храниться в таблицах в виде отдельных записей, каждая из которых имеет одинаковую структуру .
en: This data will be stored in tables as separate records, each of which has the same structure .

source: Это сообщение еще раз подтверждает тот факт, что назначение регистра накопления в том, чтобы аккумулировать данные, поставляемые другими документами.
en: This message once again confirms the fact that the purpose of the accumulation register is to accumulate data supplied by other documents.

source: Этот заголовок будет отображаться в окне списка записей регистра.
en: This title will be displayed in the register entry list window.
